@liamcervante 
Here is my configuration:
```
resource "aws_autoscaling_group" "www" {
  name                  = "www-autoscale"
  desired_capacity      = 2
  min_size              = 2
  max_size              = 2
  protect_from_scale_in = true

  launch_template {
    id = aws_launch_template.www.id
    version = "5"
  }

  target_group_arns = [
    aws_lb_target_group.www-http.arn,
    aws_lb_target_group.www-https.arn,
    aws_lb_target_group.www-https-autoscale.arn,
  ]

  lifecycle {
    create_before_destroy = true
  }

}

```


<details>
  <summary>TF plan</summary>

```
Terraform will perform the following actions:
  # aws_autoscaling_group.www will be updated in-place
  ~ resource "aws_autoscaling_group" "www" {
        id                        = "www-autoscale"
        name                      = "www-autoscale"
        # (25 unchanged attributes hidden)

      ~ launch_template {
            id      = "lt-0a94***"
            name    = "www-autoscale"
          ~ version = "4" -> "5"
        }

        # (3 unchanged blocks hidden)
    }

  # aws_eip.nat-prd_plntr will be created
  + resource "aws_eip" "nat-prd_plntr" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name" = "Public IP for plntr-nat-gateway"
        }
      + tags_all             = {
          + "Name" = "Public IP for plntr-nat-gateway"
        }
      + vpc                  = (known after apply)
    }

  # aws_lb_target_group.www-http will be updated in-place
  ~ resource "aws_lb_target_group" "www-http" {
        id                                 = "arn:aws:elasticloadbalancing:***"
        name                               = "www-http"
        tags                               = {}
        # (16 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200-299" -> "200-399"
            # (8 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_lb_target_group.www-https will be updated in-place
  ~ resource "aws_lb_target_group" "www-https" {
        id                                 = "arn:aws:elasticloadbalancing:***"
        name                               = "www-https"
        tags                               = {}
        # (16 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200-299" -> "200-399"
            # (8 unchanged attributes hidden)
        }

      ~ stickiness {
          ~ cookie_duration = 10 -> 300
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.www-https-autoscale will be updated in-place
  ~ resource "aws_lb_target_group" "www-https-autoscale" {
      + connection_termination             = false
        id                                 = "arn:aws:elasticloadbalancing:us***"
      + lambda_multi_value_headers_enabled = false
        name                               = "www-https-autoscale"
      + proxy_protocol_v2                  = false
        tags                               = {}
        # (13 unchanged attributes hidden)

      ~ health_check {
          ~ matcher             = "200-299" -> "200"
            # (8 unchanged attributes hidden)
        }

      ~ stickiness {
          ~ cookie_duration = 10 -> 86400
          ~ enabled         = true -> false
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }
```
</details>

### How to reproduce:

`terraform plan -target aws_launch_template.www -target aws_eip.nat-prd_plntr -target aws_autoscaling_group.www -out subnet`

So here I added Elastic IP and switched `www` autoscale group to use a different Launch Template. Somebody changed a load balancer configuration directly via AWS Console (Unfortunately that exists in our workflow). I do not want to revert those changes thus I explicitly `target` resources I want to update via Terraform. 

But `terraform` still want to update them.


Terraform should not updated resources if it was told to not do so. 